<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"112918b819d3f7a243df73184800627a972a92beaf828461197012c841f6907f","plan_job_ref":"Job Environment Main - Plan #51 at https://github.com/jarrod-lowe/wildsea/actions/runs/10398786833","plan_out_hash":"15c6b424e22be1b05ba00b1049110f4f24eb354a4f4f656d64b83b103ec385e7","plan_hash":"c70183b041f34f7724221f64395a96590527930f515c25072aecab7c20296d91","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.wildsea.aws_appsync_datasource.graphql will be created
+   resource "aws_appsync_datasource" "graphql" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       description      = "DynamoDB Resolver"
+       id               = (known after apply)
+       name             = "Wildsea_primary"
+       service_role_arn = (known after apply)
+       type             = "AMAZON_DYNAMODB"

+       dynamodb_config {
+           region     = "ap-southeast-2"
+           table_name = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_iam_policy.graphql_datasource will be created
+   resource "aws_iam_policy" "graphql_datasource" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "Wildsea-primary-graphql-datasource"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "dynamodb:UpdateutItem",
+                           "dynamodb:Query",
+                           "dynamodb:PutItem",
+                           "dynamodb:GetItem",
+                           "dynamodb:BatchGetItem",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags             = {
+           "Name" = "Wildsea-primary"
        }
+       tags_all         = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_iam_role.graphql_datasource will be created
+   resource "aws_iam_role" "graphql_datasource" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "appsync.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "Wildsea-primary-graphql-datasource"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Name" = "Wildsea-primary"
        }
+       tags_all              = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.wildsea.aws_iam_role_policy_attachment.graphql_datasource will be created
+   resource "aws_iam_role_policy_attachment" "graphql_datasource" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "Wildsea-primary-graphql-datasource"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #51](https://github.com/jarrod-lowe/wildsea/actions/runs/10398786833)